Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/arrests/detention_after_arrest.html.txt.tmx
Source language: en
Languages: ga

source: • An offence under Section 15 of the 1977 Act of possessing a controlled drug for unlawful sale or supply
ga: • Cion faoi Alt 15 den Acht 1977 maidir le druga rialaithe a shealbhú do sholáthar nó dhíol neamhdhleathach

source: • An offence under Section 15A of the 1977 Act of possessing a controlled drug in excess of a certain value for unlawful sale or supply
ga: • Cion faoi Alt 15A den Acht 1977 maidir le druga rialaithe a shealbhú os cionn luach áirithe do sholáthar nó dhíol neamhdhleathach

source: • An offence under Section 15B of the 1977 Act of importing controlled drugs in excess of a certain value
ga: • Cion faoi Alt 15B den Acht 1977 maidir le allmhairiú drugaí rialaithe os cionn luach áirithe

source: • An offence under Section 20 of the 1977 Act of helping or inducing the commission in another country of an offence punishable under a similar anti-drug-trafficking law in that country
ga: • Cion faoi Alt 20 den Acht 1977 maidir le cion inphionóis a spreagadh nó lámh cúnta a bheith agat ann, faoi dhlí comhchosúil frithgháinneála drugaí sa tír sin

source: • An offence under the Customs Acts in relation to the importation or exportation of a controlled drug
ga: • Cion faoin Acht Custam maidir le hallmhairiú nó onnmhairiú druga rialaithe

source: • An offence under Section 31 of the Criminal Justice Act 1994 in relation to the proceeds of drug trafficking
ga: • Cion faoi Alt 31 den Acht um Cheartas Coiriúil 1994 maidir le fáltais na gáinneála drugaí

source: • An offence under Section 33 or 34 of the 1994 Act (drug trafficking offences involving ships)
ga: • Cion faoi Alt 33 nó 34 den Acht 1994 (cionta gáinneála drugaí a bhaineann le báid)

source: • An offence of helping or conspiring to commit any of the above offences or inciting another person to do so
ga: • Cion maidir le cuidiú nó comhcheilg chun ceann ar bith de na cionta thuasluaite a dhéanamh nó duine a spreagadh lena leithéidí a dhéanamh

source: Section 50 of the Criminal Justice Act 2007
ga: Alt 50 den Acht um Cheartas Coiriúil 2007

source: Section 50 of the Criminal Justice Act 2007 applies to detention in connection with the following offences:
ga: Baineann Alt 50 den Acht um Cheartas Coiriúil 2007 le coinneáil maidir leis na cionta a leanas:

source: • Murder involving the use of a firearm or explosive
ga: • Dúnmharú a bhaineann le húsáid arm tine nó pléascán

source: • Murder to which Section 3 of the Criminal Justice Act 1990 applies (includes the murder of a Garda or prison officer)
ga: • Dúnmharú a bhaineann (ina áirítear dúnmharú Garda nó oifigigh phríosúin) le hAlt 3 den Acht um Cheartas Coiriúil 1990

source: • An offence under Section 15 of the Firearms Act 1925 (replaced by Section 42 of the Criminal Justice Act 2006)
ga: • Cion faoi Alt 15 den Acht na nArm Tine 1925 (atá athsholáthraithe ag Alt 42 den Acht um Cheartas Coiriúil 2006)

source: • An offence under Section 15 of the Non-Fatal Offences against the Person Act 1997 involving the use of a firearm (false imprisonment)
ga: • Cion faoi Alt 15 den Acht um Chionta Neamh-mharfacha in aghaidh an Duine 1997 a bhaineann le húsáid arm tine (príosúnú neamhdhleathach)

source: Section 16 and Section 17 of the Criminal Procedure Act 2007
ga: Alt 16 agus Alt 17 den Acht um Nós Imeachta Coiriúil 2007

source: Section 16 allows for you to be arrested again for certain types of offences in respect of which you have already been acquitted
ga: Ceadaíonn Alt 16 chun tú a bheith gafa arís le haghaidh cineálacha áirithe cionta i leith a bhfuil tú éigiontaíodh cheana

source: Section 17 applies if you are in prison when you are being arrested again
ga: Tá feidhm ag alt 17 má tá tú i bpríosún nuair a bhíonn tú á gafa arís

source: The types of offences to which they apply are set out in the Schedule to the Act
ga: Na cineálacha cionta a feidhm siad leagtha amach sa Sceideal a ghabhann leis an Acht
